#ifndef _ESP8266_GAGENT_USER_H_
#define _ESP8266_GAGENT_USER_H_

#include "dev_uart.h"

#include "esp8266_gagent_common.h"

DEV_GPIO_PTR led;
#define LED_PORT DW_GPIO_PORT_B
#define LED_MASK 0x1ff
#define LED_DIR  0x1ff


#define MAX_READ_CNT 32


// 定义数据点
uint8_t Room_Env_Tepm;    /* 室内环境温度，        只读，0-50 */
uint8_t Room_Env_Humidity;   /* 室内环境温度，     只读，0-100 */
uint8_t Room_Smoke;        /* 室内烟雾检测值，     只读，0-100 */
uint8_t Room_Light;      /* 室内光线检测值，       只读，0-100 */
// uint8_t Room_curtain;    /* 室内窗帘开关控制 ,     可写，0-100*/
uint8_t Room_Lamp;     /* 室内日光灯开关 ，布尔值，可写*/
uint16_t Room_PM25;     /* 室内PM2.5值，           只读，0-1500 */
uint8_t Body_infrared;  /* 人体红外感应，  布尔值，警报 */
uint8_t Leave_home;     /* 离家模式开关，  布尔值，可写 */
uint8_t Fan_switch;     /* 排风扇开关，  枚举值，可写，0.自动 1.打开 2.关毕 */





// /******************定义步进电机的接口*********************/
// #define STEP_MOTOR_PORT DW_GPIO_PORT_C
// #define STEP_MOTOR_MASK (0xF00000)
// uint8_t Room_curtain_old;



/*
函数功能：MCU向WiFi模组回复信息,并做相应控制。
控制部分应依照数据点定义以及机智云WiFi类设备接入协议文档做相应处理
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|
|receive_data   |uint8_t         |in       |uint8_t类型的指针，用来传入WiFi发送给MCU的数据                        |
|---------------|----------------|---------|----------------------------------------------------------------------|
*/
// 定义attr_flags字段的字节长度
#define ATTR_FLAGS_BYTES  (1)
// 定义attr_vals字段的字节长度
#define ATTR_VALS_BYTES   (1)
extern void mcu2wifi_wifi_ctrl_dev(DEV_UART_PTR esp8266_uart,uint8_t *receive_data);

/*
函数功能：MCU向WiFi模组回复设备当前状态。
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|
*/
//定义dev_status字段字节长度，数值可见机智云接入协议
#define DEV_STATUS_BYTES (8)
extern void mcu2wifi_wifi_read_dev(DEV_UART_PTR esp8266_uart);


/*
函数功能：MCU向WiFi模组主动设备当前状态。

注意：关于发送频率。当设备MCU收到WiFi模组控制产生的状态变化,设备MCU应立刻主动上报当前状态,发送频率不受限制。
但如设备的状态的变化是由于用户触发或环境变化所产生的,其发送的频率不能快于6秒每次。建议按需上报，有特殊上报需求请
联系机智云。

注意：设备MCU需要每隔10分钟定期主动上报当前状态。
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|

*/
extern void mcu2wifi_dev_report_status(DEV_UART_PTR esp8266_uart);

#endif