#ifndef _ESP8266_GAGENT_USER_H_
#define _ESP8266_GAGENT_USER_H_

#include "dev_uart.h"
//#include "DS18B20.h"
#include "esp8266_gagent_common.h"


// DEV_GPIO_PTR     ds18b20_port_ptr;
// DS18B20_DEF_PTR  ds18b20_data;
// #define DS18B20_PORT DW_GPIO_PORT_C
// #define DS18B20_BIT  15

#define MAX_READ_CNT 32


// 定义数据点
uint8_t Lamp_switch;    //日光灯开关，只读布尔
uint8_t Fan_switch;   //风扇开关，只读布尔
uint8_t LeaveModel_switch;        //离家模式开关
uint8_t AquariusLight_switch; //水族箱灯光开关，只读布尔

/*
函数功能：MCU向WiFi模组回复信息,并做相应控制。
控制部分应依照数据点定义以及机智云WiFi类设备接入协议文档做相应处理
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|
|receive_data   |uint8_t         |in       |uint8_t类型的指针，用来传入WiFi发送给MCU的数据                        |
|---------------|----------------|---------|----------------------------------------------------------------------|
*/
// 定义attr_flags字段的字节长度
#define ATTR_FLAGS_BYTES  (0)
// 定义attr_vals字段的字节长度
#define ATTR_VALS_BYTES   (0)
extern void mcu2wifi_wifi_ctrl_dev(DEV_UART_PTR esp8266_uart,uint8_t *receive_data);

/*
函数功能：MCU向WiFi模组回复设备当前状态。
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|
*/
//定义dev_status字段字节长度，数值可见机智云接入协议
#define DEV_STATUS_BYTES (1)
extern void mcu2wifi_wifi_read_dev(DEV_UART_PTR esp8266_uart);


/*
函数功能：MCU向WiFi模组主动设备当前状态。

注意：关于发送频率。当设备MCU收到WiFi模组控制产生的状态变化,设备MCU应立刻主动上报当前状态,发送频率不受限制。
但如设备的状态的变化是由于用户触发或环境变化所产生的,其发送的频率不能快于6秒每次。建议按需上报，有特殊上报需求请
联系机智云。

注意：设备MCU需要每隔10分钟定期主动上报当前状态。
|---------------|----------------|---------|----------------------------------------------------------------------|
|参数名         |类型            |方向     |说明                                                                  |
|---------------|----------------|---------|----------------------------------------------------------------------|
|esp8266_uart   |DEV_UART_PTR    |in       |DEV_UART类型的指针，传入前必须先使用uart_get_dev()函数进行赋值        |
|---------------|----------------|---------|----------------------------------------------------------------------|

*/
extern void mcu2wifi_dev_report_status(DEV_UART_PTR esp8266_uart);

#endif